kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-arm32/src/imxrt_ch438.c
/*
* Copyright (c) 2020 AIIT XUOS Lab
* XiOS is licensed under Mulan PSL v2.
* You can use this software according to the terms and conditions of the Mulan PSL v2.
* You may obtain a copy of Mulan PSL v2 at:
*        http://license.coscl.org.cn/MulanPSL2
* THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
* EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
* MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
* See the Mulan PSL v2 for more details.
*/

/**
 * @file imxrt_ch438.c
 * @brief imxrt board sd card automount
 * @version 1.0
 * @author AIIT XUOS Lab
 * @date 2022.04.26
 */

#include "imxrt_ch438.h"

#define CH438PORTNUM  8
#define CH438_BUFFSIZE  256
#define CH438_INCREMENT  MSEC2TICK(33)

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/
static FAR void getInterruptStatus(FAR void *arg);
static void CH438SetOutput(void);
static void CH438SetInput(void);
static uint8_t ReadCH438Data(uint8_t addr);
static void WriteCH438Data(uint8_t addr, const uint8_t dat);
static void WriteCH438Block(uint8_t mAddr, uint8_t mLen, const uint8_t *mBuf);
static void Ch438UartSend(uint8_t ext_uart_no, const uint8_t *Data, uint16_t Num);
uint8_t CH438UARTRcv(uint8_t ext_uart_no, uint8_t *buf, size_t size);
static void ImxrtCH438Init(void);
static void CH438PortInit(uint8_t ext_uart_no, uint32_t	baud_rate);
static int ImxrtCh438WriteData(uint8_t ext_uart_no, const uint8_t *write_buffer, size_t size);
static size_t ImxrtCh438ReadData(uint8_t ext_uart_no, size_t size);
static void Ch438InitDefault(void);

static int ch438_open(FAR struct file *filep);
static int ch438_close(FAR struct file *filep);
static ssize_t ch438_read(FAR struct file *filep, FAR char *buffer, size_t buflen);
static ssize_t ch438_write(FAR struct file *filep, FAR const char *buffer, size_t buflen);
static int ch438_ioctl(FAR struct file *filep, int cmd, unsigned long arg);
static int ch438_register(FAR const char *devpath, uint8_t ext_uart_no);

/****************************************************************************
 * Private type
 ****************************************************************************/
struct ch438_dev_s
{
  sem_t devsem;    /* ch438 port devsem */
  uint8_t port;    /* ch438 port number*/
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/*mutex of corresponding port*/
static pthread_mutex_t mutex[CH438PORTNUM] =
{
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER,
  PTHREAD_MUTEX_INITIALIZER
};

/* Condition variable of corresponding port */
static pthread_cond_t cond[CH438PORTNUM] =
{
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER,
  PTHREAD_COND_INITIALIZER
};

/* This array shows whether the current serial port is selected */
static bool const g_uart_selected[CH438PORTNUM] =
{
#ifdef CONFIG_CH438_EXTUART0
  [0] = true,
#endif
#ifdef CONFIG_CH438_EXTUART1
  [1] = true,
#endif
#ifdef CONFIG_CH438_EXTUART2
  [2] = true,
#endif
#ifdef CONFIG_CH438_EXTUART3
  [3] = true,
#endif
#ifdef CONFIG_CH438_EXTUART4
  [4] = true,
#endif
#ifdef CONFIG_CH438_EXTUART5
  [5] = true,
#endif
#ifdef CONFIG_CH438_EXTUART6
  [6] = true,
#endif
#ifdef CONFIG_CH438_EXTUART7
  [7] = true,
#endif
};

/* ch438 Callback work queue structure */
static struct work_s g_ch438irqwork;

/* there is data available on the corresponding port */
static volatile bool done[CH438PORTNUM] = {false,false,false,false,false,false,false,false};

/* Eight port data buffer */
static uint8_t buff[CH438PORTNUM][CH438_BUFFSIZE];

/* the value of interrupt number of SSR register */
static uint8_t Interruptnum[CH438PORTNUM] = {0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80,};

/* Offset address of serial port number */
static uint8_t offsetadd[CH438PORTNUM] = {0x00,0x10,0x20,0x30,0x08,0x18,0x28,0x38,};

/* port open status global variable */
static volatile bool g_ch438open[CH438PORTNUM] = {false,false,false,false,false,false,false,false};

/* Ch438 POSIX interface */
static const struct file_operations g_ch438fops =
{
  ch438_open,
  ch438_close,
  ch438_read,
  ch438_write,
  NULL,
  ch438_ioctl,
  NULL
};

/****************************************************************************
 * Name: getInterruptStatus
 *
 * Description:
 *   thread task getInterruptStatus
 *
 ****************************************************************************/
static FAR void getInterruptStatus(FAR void *arg)
{
    uint8_t i;
    uint8_t gInterruptStatus;  /* Interrupt register status */

    gInterruptStatus = ReadCH438Data(REG_SSR_ADDR);

    if(gInterruptStatus)
    {
        for(i = 0; i < CH438PORTNUM; i++)
        {
            if(g_uart_selected[i] && (gInterruptStatus & Interruptnum[i]))
            {
                pthread_mutex_lock(&mutex[i]);
                done[i] = true;
                pthread_cond_signal(&cond[i]);
                pthread_mutex_unlock(&mutex[i]);
            }
        }
    }

    work_queue(HPWORK, &g_ch438irqwork, getInterruptStatus, NULL, CH438_INCREMENT);
}

/****************************************************************************
 * Name: CH438SetOutput
 *
 * Description:
 *   Configure pin mode to output
 *
 ****************************************************************************/
static void CH438SetOutput(void)
{
    imxrt_config_gpio(CH438_D0_PIN_OUT);
    imxrt_config_gpio(CH438_D1_PIN_OUT);
    imxrt_config_gpio(CH438_D2_PIN_OUT);
    imxrt_config_gpio(CH438_D3_PIN_OUT);
    imxrt_config_gpio(CH438_D4_PIN_OUT);
    imxrt_config_gpio(CH438_D5_PIN_OUT);
    imxrt_config_gpio(CH438_D6_PIN_OUT);
    imxrt_config_gpio(CH438_D7_PIN_OUT);
}

/****************************************************************************
 * Name: CH438SetInput
 *
 * Description:
 *   Configure pin mode to input
 *
 ****************************************************************************/
static void CH438SetInput(void)
{
    imxrt_config_gpio(CH438_D0_PIN_INPUT);
    imxrt_config_gpio(CH438_D1_PIN_INPUT);
    imxrt_config_gpio(CH438_D2_PIN_INPUT);
    imxrt_config_gpio(CH438_D3_PIN_INPUT);
    imxrt_config_gpio(CH438_D4_PIN_INPUT);
    imxrt_config_gpio(CH438_D5_PIN_INPUT);
    imxrt_config_gpio(CH438_D6_PIN_INPUT);
    imxrt_config_gpio(CH438_D7_PIN_INPUT);
}

/****************************************************************************
 * Name: ReadCH438Data
 *
 * Description:
 *   Read data from ch438 address
 *
 ****************************************************************************/
static uint8_t ReadCH438Data(uint8_t addr)
{
    uint8_t dat = 0;
    imxrt_gpio_write(CH438_NWR_PIN, true);
    imxrt_gpio_write(CH438_NRD_PIN, true);
    imxrt_gpio_write(CH438_ALE_PIN, true);

    CH438SetOutput();
    up_udelay(1);
    
    if(addr &0x80)    imxrt_gpio_write(CH438_D7_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D7_PIN_OUT, false);
    if(addr &0x40)    imxrt_gpio_write(CH438_D6_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D6_PIN_OUT, false);
    if(addr &0x20)    imxrt_gpio_write(CH438_D5_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D5_PIN_OUT, false);
    if(addr &0x10)    imxrt_gpio_write(CH438_D4_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D4_PIN_OUT, false);
    if(addr &0x08)    imxrt_gpio_write(CH438_D3_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D3_PIN_OUT, false);
    if(addr &0x04)    imxrt_gpio_write(CH438_D2_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D2_PIN_OUT, false);
    if(addr &0x02)    imxrt_gpio_write(CH438_D1_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D1_PIN_OUT, false);
    if(addr &0x01)    imxrt_gpio_write(CH438_D0_PIN_OUT, true);   else    imxrt_gpio_write(CH438_D0_PIN_OUT, false);
        
    up_udelay(1);

    imxrt_gpio_write(CH438_ALE_PIN, false);
    up_udelay(1);        

    CH438SetInput();
    up_udelay(1);
    
