kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-arm32/src/imxrt_ch438.c
    imxrt_gpio_write(CH438_NRD_PIN, false);
    up_udelay(1);    
    
    if (imxrt_gpio_read(CH438_D7_PIN_INPUT))    dat |= 0x80;
    if (imxrt_gpio_read(CH438_D6_PIN_INPUT))    dat |= 0x40;
    if (imxrt_gpio_read(CH438_D5_PIN_INPUT))    dat |= 0x20;
    if (imxrt_gpio_read(CH438_D4_PIN_INPUT))    dat |= 0x10;
    if (imxrt_gpio_read(CH438_D3_PIN_INPUT))    dat |= 0x08;
    if (imxrt_gpio_read(CH438_D2_PIN_INPUT))    dat |= 0x04;
    if (imxrt_gpio_read(CH438_D1_PIN_INPUT))    dat |= 0x02;
    if (imxrt_gpio_read(CH438_D0_PIN_INPUT))    dat |= 0x01;
    
    imxrt_gpio_write(CH438_NRD_PIN, true);
    imxrt_gpio_write(CH438_ALE_PIN, true);
    up_udelay(1);

    return dat;
}

/****************************************************************************
 * Name: WriteCH438Data
 *
 * Description:
 *   write data to ch438 address
 *
 ****************************************************************************/
static void WriteCH438Data(uint8_t addr, const uint8_t dat)
{
    imxrt_gpio_write(CH438_ALE_PIN, true);
    imxrt_gpio_write(CH438_NRD_PIN, true);
    imxrt_gpio_write(CH438_NWR_PIN, true);

    CH438SetOutput();
    up_udelay(1);    
    
    if(addr &0x80)    imxrt_gpio_write(CH438_D7_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D7_PIN_OUT, false);
    if(addr &0x40)    imxrt_gpio_write(CH438_D6_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D6_PIN_OUT, false);
    if(addr &0x20)    imxrt_gpio_write(CH438_D5_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D5_PIN_OUT, false);
    if(addr &0x10)    imxrt_gpio_write(CH438_D4_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D4_PIN_OUT, false);
    if(addr &0x08)    imxrt_gpio_write(CH438_D3_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D3_PIN_OUT, false);
    if(addr &0x04)    imxrt_gpio_write(CH438_D2_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D2_PIN_OUT, false);
    if(addr &0x02)    imxrt_gpio_write(CH438_D1_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D1_PIN_OUT, false);
    if(addr &0x01)    imxrt_gpio_write(CH438_D0_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D0_PIN_OUT, false);

    up_udelay(1);    
    
    imxrt_gpio_write(CH438_ALE_PIN, false);
    up_udelay(1);

    if(dat &0x80)    imxrt_gpio_write(CH438_D7_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D7_PIN_OUT, false);
    if(dat &0x40)    imxrt_gpio_write(CH438_D6_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D6_PIN_OUT, false);
    if(dat &0x20)    imxrt_gpio_write(CH438_D5_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D5_PIN_OUT, false);
    if(dat &0x10)    imxrt_gpio_write(CH438_D4_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D4_PIN_OUT, false);
    if(dat &0x08)    imxrt_gpio_write(CH438_D3_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D3_PIN_OUT, false);
    if(dat &0x04)    imxrt_gpio_write(CH438_D2_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D2_PIN_OUT, false);
    if(dat &0x02)    imxrt_gpio_write(CH438_D1_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D1_PIN_OUT, false);
    if(dat &0x01)    imxrt_gpio_write(CH438_D0_PIN_OUT, true);    else    imxrt_gpio_write(CH438_D0_PIN_OUT, false);
    
    up_udelay(1);    

    imxrt_gpio_write(CH438_NWR_PIN, false);
    up_udelay(1);    
    
    imxrt_gpio_write(CH438_NWR_PIN, true);
    imxrt_gpio_write(CH438_ALE_PIN, true);
    up_udelay(1);    

    CH438SetInput();

    return;
}

/****************************************************************************
 * Name: WriteCH438Block
 *
 * Description:
 *   Write data block from ch438 address
 *
 ****************************************************************************/
static void WriteCH438Block(uint8_t mAddr, uint8_t mLen, const uint8_t *mBuf)
{
    while(mLen--)
        WriteCH438Data(mAddr, *mBuf++);
}

/****************************************************************************
 * Name: CH438UARTSend
 *
 * Description:
 *   Enable FIFO mode, which is used for ch438 serial port to send multi byte data,
 *   with a maximum of 128 bytes of data sent at a time
 *
 ****************************************************************************/
static void Ch438UartSend(uint8_t ext_uart_no, const uint8_t *Data, uint16_t Num)
{
    uint8_t REG_LSR_ADDR,REG_THR_ADDR;
    REG_LSR_ADDR = offsetadd[ext_uart_no] | REG_LSR0_ADDR;
    REG_THR_ADDR = offsetadd[ext_uart_no] | REG_THR0_ADDR;
    
    while(1)
    {
        while((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_TEMT) == 0); /* wait for sending data done, THR and TSR is NULL */
        if(Num <= 128)
        {
            WriteCH438Block(REG_THR_ADDR, Num, Data);
            break;
        }
        else
        {
            WriteCH438Block(REG_THR_ADDR, 128, Data);
            Num -= 128;
            Data += 128;
        }
    }
}

/****************************************************************************
 * Name: CH438UARTRcv
 *
 * Description:
 *   Disable FIFO mode for ch438 serial port to receive multi byte data
 *
 ****************************************************************************/
uint8_t CH438UARTRcv(uint8_t ext_uart_no, uint8_t *buf, size_t size)
{
    uint8_t rcv_num = 0;
    uint8_t dat = 0;
    uint8_t REG_LSR_ADDR,REG_RBR_ADDR;
    uint8_t *read_buffer;
    size_t buffer_index = 0;

    read_buffer = buf;

    REG_LSR_ADDR = offsetadd[ext_uart_no] | REG_LSR0_ADDR;
    REG_RBR_ADDR = offsetadd[ext_uart_no] | REG_RBR0_ADDR;

    /* Wait for the data to be ready */	
    while ((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_DATARDY) == 0);

    while (((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_DATARDY) == 0x01) && (size != 0))
    {
        dat = ReadCH438Data(REG_RBR_ADDR);
        *read_buffer = dat;
        read_buffer++;
        buffer_index++;
        if (255 == buffer_index) {
            buffer_index = 0;
            read_buffer = buf;
        }

        ++rcv_num;
        --size;
    }

    return rcv_num;
}

/****************************************************************************
 * Name: ImxrtCH438Init
 *
 * Description:
 *   ch438 initialization
 *
 ****************************************************************************/
static void ImxrtCH438Init(void)
{
    CH438SetOutput();
    imxrt_config_gpio(CH438_NWR_PIN);
    imxrt_config_gpio(CH438_NRD_PIN);
    imxrt_config_gpio(CH438_ALE_PIN);
    
