kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-arm32/src/imxrt_ch438.c
    imxrt_gpio_write(CH438_NWR_PIN,true);
    imxrt_gpio_write(CH438_NRD_PIN,true);
    imxrt_gpio_write(CH438_ALE_PIN,true);
}

/****************************************************************************
 * Name: CH438PortInit
 *
 * Description:
 *   ch438 port initialization
 *
 ****************************************************************************/
static void CH438PortInit(uint8_t ext_uart_no, uint32_t baud_rate)
{
    uint32_t div;
    uint8_t DLL,DLM,dlab;
    uint8_t REG_LCR_ADDR;
    uint8_t REG_DLL_ADDR;
    uint8_t REG_DLM_ADDR;
    uint8_t REG_IER_ADDR;
    uint8_t REG_MCR_ADDR;
    uint8_t REG_FCR_ADDR;

    REG_LCR_ADDR = offsetadd[ext_uart_no] | REG_LCR0_ADDR;
    REG_DLL_ADDR = offsetadd[ext_uart_no] | REG_DLL0_ADDR;
    REG_DLM_ADDR = offsetadd[ext_uart_no] | REG_DLM0_ADDR;
    REG_IER_ADDR = offsetadd[ext_uart_no] | REG_IER0_ADDR;
    REG_MCR_ADDR = offsetadd[ext_uart_no] | REG_MCR0_ADDR;
    REG_FCR_ADDR = offsetadd[ext_uart_no] | REG_FCR0_ADDR;

    /* reset the uart */
    WriteCH438Data(REG_IER_ADDR, BIT_IER_RESET); 
    up_mdelay(50);

    dlab = ReadCH438Data(REG_IER_ADDR);
    dlab &= 0xDF;
    WriteCH438Data(REG_IER_ADDR, dlab);
    
    /* set LCR register DLAB bit 1 */
    dlab = ReadCH438Data(REG_LCR_ADDR);
    dlab |= 0x80;
    WriteCH438Data(REG_LCR_ADDR, dlab);

    div = (Fpclk >> 4) / baud_rate;
    DLM = div >> 8;
    DLL = div & 0xff;

    /* set bps */
    WriteCH438Data(REG_DLL_ADDR, DLL);
    WriteCH438Data(REG_DLM_ADDR, DLM);

    /* set FIFO mode, 112 bytes */
    WriteCH438Data(REG_FCR_ADDR, BIT_FCR_RECVTG1 | BIT_FCR_RECVTG0 | BIT_FCR_FIFOEN);

    /* 8 bit word size, 1 bit stop bit, no crc */
    WriteCH438Data(REG_LCR_ADDR, BIT_LCR_WORDSZ1 | BIT_LCR_WORDSZ0);

    /* enable interrupt */
    WriteCH438Data(REG_IER_ADDR, BIT_IER_IERECV);

    /* allow interrupt output, DTR and RTS is 1 */
    WriteCH438Data(REG_MCR_ADDR, BIT_MCR_OUT2);

    /* release the data in FIFO */
    WriteCH438Data(REG_FCR_ADDR, ReadCH438Data(REG_FCR_ADDR)| BIT_FCR_TFIFORST);
}

/****************************************************************************
 * Name: ImxrtCh438ReadData
 *
 * Description:
 *   Read data from ch438 port
 *
 ****************************************************************************/
static int ImxrtCh438WriteData(uint8_t ext_uart_no, const uint8_t *write_buffer, size_t size)
{
    int write_len, write_len_continue;
    int i, write_index;
    DEBUGASSERT(write_buffer != NULL);

    write_len = size;
    write_len_continue = size;

    if(write_len > 256) 
    {
        if(0 == write_len % 256) 
        {
            write_index = write_len / 256;
            for(i = 0; i < write_index; i ++) 
            {
                Ch438UartSend(ext_uart_no, write_buffer + i * 256, 256);
            }
        }
        else
        {
            write_index = 0;
            while(write_len_continue > 256) 
            {
                Ch438UartSend(ext_uart_no, write_buffer + write_index * 256, 256);
                write_index++;
                write_len_continue = write_len - write_index * 256;
            }
            Ch438UartSend(ext_uart_no, write_buffer + write_index * 256, write_len_continue);
        }
    } 
    else
    {
        Ch438UartSend(ext_uart_no, write_buffer, write_len);
    }

    return OK;
}

/****************************************************************************
 * Name: ImxrtCh438ReadData
 *
 * Description:
 *   Read data from ch438 port
 *
 ****************************************************************************/
static size_t ImxrtCh438ReadData(uint8_t ext_uart_no, size_t size)
{
    size_t RevLen = 0;
    uint8_t InterruptStatus;
    uint8_t REG_IIR_ADDR;
    uint8_t REG_LSR_ADDR;
    uint8_t REG_MSR_ADDR;

    pthread_mutex_lock(&mutex[ext_uart_no]);
    while(done[ext_uart_no] == false)
        pthread_cond_wait(&cond[ext_uart_no], &mutex[ext_uart_no]);
    if(done[ext_uart_no] == true)
    {
        REG_IIR_ADDR = offsetadd[ext_uart_no] | REG_IIR0_ADDR;
        REG_LSR_ADDR = offsetadd[ext_uart_no] | REG_LSR0_ADDR;
        REG_MSR_ADDR = offsetadd[ext_uart_no] | REG_MSR0_ADDR;
        /* Read the interrupt status of the serial port */
        InterruptStatus = ReadCH438Data(REG_IIR_ADDR) & 0x0f;
        ch438info("InterruptStatus is %d\n", InterruptStatus);

        switch(InterruptStatus)
        {
            case INT_NOINT:            /* no interrupt */
                break;
            case INT_THR_EMPTY:        /* the transmit hold register is not interrupted */
                break;
            case INT_RCV_OVERTIME:     /* receive data timeout interrupt */
            case INT_RCV_SUCCESS:      /* receive data available interrupt */
                RevLen = CH438UARTRcv(ext_uart_no, buff[ext_uart_no], size);
                break;
            case INT_RCV_LINES:       /* receive line status interrupt */
                ReadCH438Data(REG_LSR_ADDR);
                break;
            case INT_MODEM_CHANGE:    /* modem input change interrupt */
                ReadCH438Data(REG_MSR_ADDR);
                break;
            default:
                break;
        }
        done[ext_uart_no]  = false;
    }
    pthread_mutex_unlock(&mutex[ext_uart_no]);

    return RevLen;
}

/****************************************************************************
 * Name: Ch438InitDefault
 *
 * Description:
 *   Ch438 default initialization function
 *
 ****************************************************************************/
static void Ch438InitDefault(void)
{ 
    int ret = 0;
    int i;

    /* Initialize the mutex */
    for(i = 0; i < CH438PORTNUM; i++)
    {
        if(!g_uart_selected[i])
        {
            continue;
        }
        
        ret = pthread_mutex_init(&mutex[i], NULL);
        if(ret != 0)
        {
            ch438err("pthread_mutex_init failed, status=%d\n", ret);
        }
    }

    /* Initialize the condition variable */
    for(i = 0; i < CH438PORTNUM; i++)
    {
        if(!g_uart_selected[i])
        {
            continue;
        }
        
